Revit 2027 API
RebarConstraint.IsToHostEdge Method
 Checks if the RebarConstraintType of the RebarConstraint is 'ToHostEdge'.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsToHostEdge()
Public Function IsToHostEdge As Boolean
public:
bool IsToHostEdge()
member IsToHostEdge : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstraintType of the RebarConstraint is 'ToHostEdge', false otherwise.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace